In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('G22_Energy â€“ Power Plants  Regions with Grid Operators_merged.csv')

In [3]:
df.head(3)

,powerplant_id,region_id,distribution_date,energy_supplied,plant_name,capacity,plant_type,operator_id,region_name,area,population,operator_name,contact
0,76,25,2025-01-25,1062,Ramirez LLC,515,Solar,2,treatment,4393,700514,Karla Williams,746.435.9498
1,98,5,2025-01-18,6961,Schaefer and Sons,738,Nuclear,15,leader,4787,957156,Thomas Ramsey Jr.,974-935-3350
2,3,26,2025-02-08,6987,Brown Inc,438,Wind,18,with,154,217686,Alexander Peck,596.919.9974

In [7]:
df.sort_values('powerplant_id').head(6)

,powerplant_id,region_id,distribution_date,energy_supplied,plant_name,capacity,plant_type,operator_id,region_name,area,population,operator_name,contact
98,1,36,2025-02-22,2457,Jones-Alvarez,419,Nuclear,11,suggest,1365,638048,Nancy Taylor,456.498.4947
567,1,15,2025-02-15,7702,Jones-Alvarez,419,Nuclear,11,product,4684,162531,Nancy Taylor,456.498.4947
552,1,12,2025-02-16,7202,Jones-Alvarez,419,Nuclear,11,draw,7439,732796,Nancy Taylor,456.498.4947
207,1,31,2025-01-16,8229,Jones-Alvarez,419,Nuclear,11,main,371,337108,Nancy Taylor,456.498.4947
421,1,37,2025-01-31,8375,Jones-Alvarez,419,Nuclear,11,girl,7259,155879,Nancy Taylor,456.498.4947
148,1,6,2025-01-27,2334,Jones-Alvarez,419,Nuclear,11,wall,1707,496580,Nancy Taylor,456.498.4947

In [14]:
Powerplant = df.loc[:,['powerplant_id','plant_name','capacity','plant_type', 'operator_id']]

In [16]:
Powerplant.head(3)

   powerplant_id         plant_name  capacity plant_type  operator_id
0             76        Ramirez LLC       515      Solar            2
1             98  Schaefer and Sons       738    Nuclear           15
2              3          Brown Inc       438       Wind           18

In [18]:
Powerplant.columns=['id', 'name', 'capacity', 'type', 'operator id']

In [20]:
len(Powerplant['id'].unique())

100

In [22]:
len(Powerplant)

800

In [24]:
Powerplant.drop_duplicates(subset='id',inplace=True)

In [26]:
len(Powerplant)

100

In [28]:
Powerplant.head(3)

   id               name  capacity     type  operator id
0  76        Ramirez LLC       515    Solar            2
1  98  Schaefer and Sons       738  Nuclear           15
2   3          Brown Inc       438     Wind           18

In [30]:
from sqlalchemy import create_engine

In [31]:
engine = create_engine('sqlite:///Energy.db')

In [32]:
Powerplant.to_sql('Powerplant', con =engine, if_exists='replace', index=False)

100

In [33]:
df.sort_values('region_id').head(6)

,powerplant_id,region_id,distribution_date,energy_supplied,plant_name,capacity,plant_type,operator_id,region_name,area,population,operator_name,contact
395,21,1,2025-01-11,5114,Gomez-Lewis,915,Wind,14,yourself,6875,283881,Eric James,631-884-7163x6622
350,26,1,2025-02-08,3982,Farmer-Moore,460,Hydro,13,yourself,6875,283881,Amanda Brewer,+1-709-384-6793x40569
234,43,1,2025-01-10,4727,Hayes-Morgan,246,Nuclear,14,yourself,6875,283881,Eric James,631-884-7163x6622
418,84,1,2025-01-25,790,Hardin PLC,346,Nuclear,10,yourself,6875,283881,Joseph Avery,(675)499-8210x26579
208,85,1,2025-01-28,3654,Robinson-Brewer,190,Wind,7,yourself,6875,283881,Andrew Molina,260-952-5460x9017
501,57,1,2025-02-06,7998,Goodman LLC,821,Wind,16,yourself,6875,283881,Jaime Schmidt,469.261.3586x0432

In [34]:
Region = df.loc[:,['region_id','region_name','area', 'population']]

In [35]:
Region.head(3)

   region_id region_name  area  population
0         25   treatment  4393      700514
1          5      leader  4787      957156
2         26        with   154      217686

In [36]:
Region.columns=['id', 'name', 'area', 'population']

In [38]:
len(Region['id'].unique())

50

In [41]:
len(Region)

800

In [46]:
Region.drop_duplicates(subset='id',inplace=True)

In [49]:
len(Region)

50

In [52]:
Region.head(3)

   id       name  area  population
0  25  treatment  4393      700514
1   5     leader  4787      957156
2  26       with   154      217686

In [54]:
Region.to_sql('Region', con =engine, if_exists='replace', index=False)

50

In [56]:
df.sort_values('operator_id').head(6)

,powerplant_id,region_id,distribution_date,energy_supplied,plant_name,capacity,plant_type,operator_id,region_name,area,population,operator_name,contact
450,86,16,2025-01-18,6518,Thompson Group,378,Nuclear,1,since,8610,173045,Geoffrey Rowe,+1-470-992-8199x713
556,39,28,2025-01-20,6319,Phillips-Glass,104,Hydro,1,sometimes,3855,939660,Geoffrey Rowe,+1-470-992-8199x713
548,39,31,2025-01-27,3253,Phillips-Glass,104,Hydro,1,main,371,337108,Geoffrey Rowe,+1-470-992-8199x713
517,86,26,2025-01-01,1687,Thompson Group,378,Nuclear,1,with,154,217686,Geoffrey Rowe,+1-470-992-8199x713
515,56,28,2025-02-12,3389,Christensen Ltd,714,Solar,1,sometimes,3855,939660,Geoffrey Rowe,+1-470-992-8199x713
498,97,41,2025-01-16,8863,Smith PLC,155,Nuclear,1,probably,4696,454566,Geoffrey Rowe,+1-470-992-8199x713

In [58]:
GridOperator = df.loc[:,['operator_id','operator_name','contact']]

In [60]:
GridOperator.head(3)

   operator_id      operator_name       contact
0            2     Karla Williams  746.435.9498
1           15  Thomas Ramsey Jr.  974-935-3350
2           18     Alexander Peck  596.919.9974

In [62]:
GridOperator.columns=['id', 'name', 'contact']

In [64]:
len(GridOperator['id'].unique())

20

In [66]:
len(GridOperator)

800

In [68]:
GridOperator.drop_duplicates(subset='id',inplace=True)

In [70]:
len(GridOperator)

20

In [72]:
GridOperator.head(3)

   id               name       contact
0   2     Karla Williams  746.435.9498
1  15  Thomas Ramsey Jr.  974-935-3350
2  18     Alexander Peck  596.919.9974

In [74]:
GridOperator.to_sql('GridOperator', con =engine, if_exists='replace', index=False)

20

In [76]:
df['distribution_id'] = range(1, len(df) + 1)

In [78]:
df.sort_values('distribution_id').head(6)

,powerplant_id,region_id,distribution_date,energy_supplied,plant_name,capacity,plant_type,operator_id,region_name,area,population,operator_name,contact,distribution_id
0,76,25,2025-01-25,1062,Ramirez LLC,515,Solar,2,treatment,4393,700514,Karla Williams,746.435.9498,1
1,98,5,2025-01-18,6961,Schaefer and Sons,738,Nuclear,15,leader,4787,957156,Thomas Ramsey Jr.,974-935-3350,2
2,3,26,2025-02-08,6987,Brown Inc,438,Wind,18,with,154,217686,Alexander Peck,596.919.9974,3
3,75,34,2025-01-08,3685,Moody-Jones,860,Nuclear,18,open,1610,182975,Alexander Peck,596.919.9974,4
4,91,23,2025-02-08,6581,Washington-Rodriguez,357,Wind,9,almost,7874,156719,Jesus Farmer,001-761-463-3181x90875,5
5,51,1,2025-01-23,2499,Rios-Davis,685,Nuclear,8,yourself,6875,283881,Jason Rogers,318.998.1018x29895,6

In [80]:
Distribution = df.loc[:,['distribution_id','powerplant_id','region_id','distribution_date','energy_supplied']]

In [82]:
Distribution.head(3)

,distribution_id,powerplant_id,region_id,distribution_date,energy_supplied
0,1,76,25,2025-01-25,1062
1,2,98,5,2025-01-18,6961
2,3,3,26,2025-02-08,6987

In [84]:
Distribution.columns=['id', 'powerplant id', 'region id', 'distribution date', 'energy supplied']

In [86]:
len(Distribution['id'].unique())

800

In [88]:
len(Distribution)

800

In [90]:
Distribution.drop_duplicates(subset='id',inplace=True)

In [92]:
len(Distribution)

800

In [94]:
Distribution.head(3)

   id  powerplant id  region id distribution date  energy supplied
0   1             76         25        2025-01-25             1062
1   2             98          5        2025-01-18             6961
2   3              3         26        2025-02-08             6987

In [96]:
Distribution.to_sql('Distribution', con =engine, if_exists='replace', index=False)

800

In [98]:
engine.dispose()